package searchengine;

/* Βρηκα 3 τρόπους για να προσθέσουμε τα stop words στην κλάση, εδώ χρησιμοποιώ τον έναν
 * 2ος τρόπος : αποθήκευση τους σε αρχείο (stopwords.txt) και εισαγωγή του με FileReader 
 * 3ος τρόπος : δημιουργία HashSet και προσθήκη των stop words με add("a"); add("able"); κτλ
 * 
 * Πηγή για τα Αγγλικά stop words : 
 * https://gist.github.com/shuson/b3051fae05b312360a18
 * Προσθήκες στα Αγγλικά stop words : "ll" , "ve" 
 * 
 * Πηγή για τα Ελληνικά stop words : 
 * https://github.com/xtsimpouris/gr-nlp-law/blob/master/Greek%20Stopwords/stopwords.txt
 * Eνέργειες για τα Ελληνικά stop words : case folding (toLowerCase())
 * Αφαιρέσεις από τα Ελληνικά stop words : "συχνου" (υπήρχε 2 φορές)
 * Προσθήκες στα Ελληνικά stopwords : "α","αργοτερα","β","γ","δ","ε","ει","ζ","η","κ","λ","μ",
 * "ν","ξ","π","ρ","σ","τ","υ","φ","φερ","χ","ψ". 
 */ 

public class RemoveStopWords {

  String[] stopwords = {"a","able","about","above","according","accordingly","across",
    "actually","after","afterwards","again","against","all","allow","allows","almost",
    "alone","along","already","also","although","always","am","among","amongst","an","and",
    "another","any","anybody","anyhow","anyone","anything","anyway","anyways","anywhere","apart",
    "appear","appreciate","appropriate","are","around","as","aside","ask","asking","associated",
    "at","available","away","awfully","b","be","became","because","become","becomes","becoming",
    "been","before","beforehand","behind","being","believe","below","beside","besides","best",
    "better","between","beyond","both","brief","but","by","c","came","can","cannot","cant","cause",
    "causes","certain","certainly","changes","clearly","co","com","come","comes","concerning",
    "consequently","consider","considering","contain","containing","contains","corresponding",
    "could","course","currently","d","definitely","described","despite","did","different","do",
    "does","doing","done","down","downwards","during","e","each","edu","eg","eight","either",
    "else","elsewhere","enough","entirely","especially","et","etc","even","ever","every",
    "everybody","everyone","everything","everywhere","ex","exactly","example","except","f","far",
    "few","fifth","first","five","followed","following","follows","for","former","formerly",
    "forth","four","from","further","furthermore","g","get","gets","getting","given","gives","go",
    "goes","going","gone","got","gotten","greetings","h","had","happens","hardly","has","have",
    "having","he","hello","help","hence","her","here","hereafter","hereby","herein","hereupon",
    "hers","herself","hi","him","himself","his","hither","hopefully","how","howbeit","however","i",
    "ie","if","ignored","immediate","in","inasmuch","inc","indeed","indicate","indicated",
    "indicates","inner","insofar","instead","into","inward","is","it","its","itself","j","just",
    "k","keep","keeps","kept","know","knows","known","l","last","lately","later","latter",
    "latterly","least","less","lest","let","like","liked","likely","little","ll","you'll","look",
    "looking","looks","ltd","m","mainly","many","may","maybe","me","mean","meanwhile","merely",
    "might","more","moreover","most","mostly","much","must","my","myself","n","name","namely","nd",
    "near","nearly","necessary","need","needs","neither","never","nevertheless","new","next",
    "nine","no","nobody","non","none","noone","nor","normally","not","nothing","novel","now",
    "nowhere","o","obviously","of","off","often","oh","ok","okay","old","on","once","one","ones",
    "only","onto","or","other","others","otherwise","ought","our","ours","ourselves","out",
    "outside","over","overall","own","p","particular","particularly","per","perhaps","placed",
    "please","plus","possible","presumably","probably","provides","q","que","quite","qv","r",
    "rather","rd","re","really","reasonably","regarding","regardless","regards","relatively",
    "respectively","right","s","said","same","saw","say","saying","says","second","secondly","see",
    "seeing","seem","seemed","seeming","seems","seen","self","selves","sensible","sent","serious",
    "seriously","seven","several","shall","she","should","since","six","so","some","somebody",
    "somehow","someone","something","sometime","sometimes","somewhat","somewhere","soon","sorry",
    "specified","specify","specifying","still","sub","such","sup","sure","t","take","taken","tell",
    "tends","th","than","thank","thanks","thanx","that","thats","the","their","theirs","them",
    "themselves","then","thence","there","thereafter","thereby","therefore","therein","theres",
    "thereupon","these","they","think","third","this","thorough","thoroughly","those","though",
    "three","through","throughout","thru","thus","to","together","too","took","toward","towards",
    "tried","tries","truly","try","trying","twice","two","u","un","under","unfortunately","unless",
    "unlikely","until","unto","up","upon","us","use","used","useful","uses","using","usually",
    "uucp","v","value","various","you've","ve","very","via","viz","vs","w","want","wants","was",
    "way","we","welcome","well","went","were","what","whatever","when","whence","whenever","where",
    "whereafter","whereas","whereby","wherein","whereupon","wherever","whether","which","while",
    "whither","who","whoever","whole","whom","whose","why","will","willing","wish","with","within",
    "without","wonder","would","would","x","y","yes","yet","you","your","yours","yourself",
    "yourselves","z","zero",
    "α","αδιακοπα","αι","ακομα","ακομη","ακριβως","αληθεια","αληθινα","αλλα","αλλαχου","αλλες",
    "αλλη","αλλην","αλλης","αλλιως","αλλιωτικα","αλλο","αλλοι","αλλοιως","αλλοιωτικα","αλλον",
    "αλλος","αλλοτε","αλλου","αλλους","αλλων","αμα","αμεσα","αμεσως","αν","ανα","αναμεσα",
    "αναμεταξυ","ανευ","αντι","αντιπερα","αντις","ανω","ανωτερω","αξαφνα","απ","απεναντι","απο",
    "αποψε","αρα","αραγε","αργα","αργοτερα","αργοτερο","αριστερα","αρκετα","αρχικα","ας","αυριο",
    "αυτα","αυτες","αυτη","αυτην","αυτης","αυτο","αυτοι","αυτον","αυτος","αυτου","αυτους","αυτων",
    "αφοτου","αφου","β","βεβαια","βεβαιοτατα","γ","γι","για","γρηγορα","γυρω","δ","δα","δε",
    "δεινα","δεν","δεξια","δηθεν","δηλαδη","δι","δια","διαρκως","δικα","δικο","δικοι","δικος",
    "δικου","δικους","διολου","διπλα","διχως","ε","εαν","εαυτο","εαυτον","εαυτου","εαυτους",
    "εαυτων","εγκαιρα","εγκαιρως","εγω","εδω","ει","ειδεμη","ειθε","ειμαι","ειμαστε","ειναι","εις",
    "εισαι","εισαστε","ειστε","ειτε","ειχα","ειχαμε","ειχαν","ειχατε","ειχε","ειχες","εκαστα",
    "εκαστες","εκαστη","εκαστην","εκαστης","εκαστο","εκαστοι","εκαστον","εκαστος","εκαστου",
    "εκαστους","εκαστων","εκει","εκεινα","εκεινες","εκεινη","εκεινην","εκεινης","εκεινο","εκεινοι",
    "εκεινον","εκεινος","εκεινου","εκεινους","εκεινων","εκτος","εμας","εμεις","εμενα","εμπρος",
    "εν","ενα","εναν","ενας","ενος","εντελως","εντος","εντωμεταξυ","ενω","εξ","εξαφνα","εξης",
    "εξισου","εξω","επανω","επειδη","επειτα","επι","επισης","επομενως","εσας","εσεις","εσενα",
    "εστω","εσυ","ετερα","ετεραι","ετερας","ετερες","ετερη","ετερης","ετερο","ετεροι","ετερον",
    "ετερος","ετερου","ετερους","ετερων","ετουτα","ετουτες","ετουτη","ετουτην","ετουτης","ετουτο",
    "ετουτοι","ετουτον","ετουτος","ετουτου","ετουτους","ετουτων","ετσι","ευγε","ευθυς","ευτυχως",
    "εφεξης","εχει","εχεις","εχετε","εχθες","εχομε","εχουμε","εχουν","εχτες","εχω","εως","ζ","η",
    "ηδη","ημασταν","ημαστε","ημουν","ησασταν","ησαστε","ησουν","ηταν","ητανε","ητοι","ηττον",
    "θ","θα","ι","ιδια","ιδιαν","ιδιας","ιδιες","ιδιο","ιδιοι","ιδιον","ιδιος","ιδιου","ιδιους",
    "ιδιων","ιδιως","ιι","ιιι","ισαμε","ισια","ισως","κ","καθε","καθεμια","καθεμιας","καθενα",
    "καθενας","καθενος","καθετι","καθολου","καθως","και","κακα","κακως","καλα","καλως","καμια",
    "καμιαν","καμιας","καμποσα","καμποσες","καμποση","καμποσην","καμποσης","καμποσο","καμποσοι",
    "καμποσον","καμποσος","καμποσου","καμποσους","καμποσων","κανεις","κανεν","κανενα","κανεναν",
    "κανενας","κανενος","καποια","καποιαν","καποιας","καποιες","καποιο","καποιοι","καποιον",
    "καποιος","καποιου","καποιους","καποιων","καποτε","καπου","καπως","κατ","κατα","κατι","κατιτι",
    "κατοπιν","κατω","κιολας","κλπ","κοντα","κτλ","κυριως","λ","λιγακι","λιγο","λιγωτερο","λογω",
    "λοιπα","λοιπον","μ","μα","μαζι","μακαρι","μακρυα","μαλιστα","μαλλον","μας","με","μεθαυριο",
    "μειον","μελει","μελλεται","μεμιας","μεν","μερικα","μερικες","μερικοι","μερικους","μερικων",
    "μεσα","μετ","μετα","μεταξυ","μεχρι","μη","μηδε","μην","μηπως","μητε","μια","μιαν","μιας",
    "μολις","μολονοτι","μοναχα","μονες","μονη","μονην","μονης","μονο","μονοι","μονομιας","μονος",
    "μονου","μονους","μονων","μου","μπορει","μπορουν","μπραβο","μπρος","ν","να","ναι","νωρις","ξ",
    "ξανα","ξαφνικα","ο","οι","ολα","ολες","ολη","ολην","ολης","ολο","ολογυρα","ολοι","ολον",
    "ολονεν","ολος","ολοτελα","ολου","ολους","ολων","ολως","ολωσδιολου","ομως","οποια",
    "οποιαδηποτε","οποιαν","οποιανδηποτε","οποιας","οποιασδηποτε","οποιδηποτε","οποιες",
    "οποιεσδηποτε","οποιο","οποιοδηποτε","οποιοι","οποιον","οποιονδηποτε","οποιος","οποιοσδηποτε",
    "οποιου","οποιουδηποτε","οποιους","οποιουσδηποτε","οποιων","οποιωνδηποτε","οποτε",
    "οποτεδηποτε","οπου","οπουδηποτε","οπως","ορισμενα","ορισμενες","ορισμενων","ορισμενως","οσα",
    "οσαδηποτε","οσες","οσεσδηποτε","οση","οσηδηποτε","οσην","οσηνδηποτε","οσης","οσησδηποτε",
    "οσο","οσοδηποτε","οσοι","οσοιδηποτε","οσον","οσονδηποτε","οσος","οσοσδηποτε","οσου",
    "οσουδηποτε","οσους","οσουσδηποτε","οσων","οσωνδηποτε","οταν","οτι","οτιδηποτε","οτου","ου",
    "ουδε","ουτε","οχι","π","παλι","παντοτε","παντου","παντως","παρα","περα","περι","περιπου",
    "περισσοτερο","περσι","περυσι","πια","πιθανον","πιο","πισω","πλαι","πλεον","πλην","ποια",
    "ποιαν","ποιας","ποιες","ποιο","ποιοι","ποιον","ποιος","ποιου","ποιους","ποιων","πολυ","ποσες",
    "ποση","ποσην","ποσης","ποσοι","ποσος","ποσους","ποτε","που","πουθε","πουθενα","πρεπει","πριν",
    "προ","προκειμενου","προκειται","προπερσι","προς","προτου","προχθες","προχτες","πρωτυτερα",
    "πως","ρ","σ","σαν","σας","σε","σεις","σημερα","σιγα","σου","στα","στη","στην","στης","στις",
    "στο","στον","στου","στους","στων","συγχρονως","συν","συναμα","συνεπως","συνηθως","συχνα",
    "συχνας","συχνες","συχνη","συχνην","συχνης","συχνο","συχνοι","συχνον","συχνος","συχνου",
    "συχνου","συχνους","συχνων","συχνως","σχεδον","σωστα","τ","τα","ταδε","ταυτα","ταυτες","ταυτη",
    "ταυτην","ταυτης","ταυτο","ταυτον","ταυτος","ταυτου","ταυτων","ταχα","ταχατε","τελικα",
    "τελικως","τες","τετοια","τετοιαν","τετοιας","τετοιες","τετοιο","τετοιοι","τετοιον","τετοιος",
    "τετοιου","τετοιους","τετοιων","τη","την","της","τι","τιποτα","τιποτε","τις","το","τοι","τον",
    "τος","τοσα","τοσες","τοση","τοσην","τοσης","τοσο","τοσοι","τοσον","τοσος","τοσου","τοσους",
    "τοσων","τοτε","του","τουλαχιστο","τουλαχιστον","τους","τουτα","τουτες","τουτη","τουτην",
    "τουτης","τουτο","τουτοι","τουτοις","τουτον","τουτος","τουτου","τουτους","τουτων","τυχον",
    "των","τωρα","υ","υπ","υπερ","υπο","υποψη","υποψιν","υστερα","φ","φερ","φετος","χ","χαμηλα",
    "χθες","χτες","χωρις","χωριστα","ψ","ψηλα","ω","ωραια","ως","ωσαν","ωσοτου","ωσπου","ωστε",
    "ωστοσο","ωχ"};                     

/* Για να δούμε αν το κείμενο που μας ενδιαφέρει περιέχει stop words και για την αφαίρεση τους
 * θα χρησιμοποιήσουμε ένα for.
 * 
 * wordList : περιέχει τις λέξεις που θέλουμε να δούμε αν περιέχουν stop words
 *  
 *  for (int j=0; j< stopwords.length; j++) {
 *    if (wordList.contains(stopwords[j])) {
 *    wordList.remove(stopwords[j]);
 *  }
 */

}
