package searchengine;

/* Βρηκα 3 τρόπους για να προσθέσουμε τα stop words στην κλάση, εδώ χρησιμοποιώ τον έναν
 * 2ος τρόπος : αποθήκευση τους σε αρχείο (stopwords.txt) και εισαγωγή του με FileReader 
 * 3ος τρόπος : δημιουργία HashSet και προσθήκη των stop words με add("a"); add("able"); κτλ
 * 
 * Πηγή για τα Αγγλικά stop words : 
 * https://gist.github.com/shuson/b3051fae05b312360a18
 * Προσθήκες στα Αγγλικά stop words : "ll" , "ve" 
 * 
 * Πηγή για τα Ελληνικά stop words : 
 * https://github.com/xtsimpouris/gr-nlp-law/blob/master/Greek%20Stopwords/stopwords.txt
 * Eνέργειες για τα Ελληνικά stop words : case folding (toLowerCase())
 * Αφαιρέσεις από τα Ελληνικά stop words : "συχνου" (υπήρχε 2 φορές)
 * Προσθήκες στα Ελληνικά stopwords : "α","αργοτερα","β","γ","δ","ε","ει","ζ","η","κ","λ","μ",
 * "ν","ξ","π","ρ","σ","τ","υ","φ","φερ","χ","ψ". 
 */ 

public class RemoveStopWords {

  String[] stopwords = {"a","able","about","above","according","accordingly","across",
    "actually","after","afterwards","again","against","all","allow","allows","almost",
    "alone","along","already","also","although","always","am","among","amongst","an","and",
    "another","any","anybody","anyhow","anyone","anything","anyway","anyways","anywhere","apart",
    "appear","appreciate","appropriate","are","around","as","aside","ask","asking","associated",
    "at","available","away","awfully","b","be","became","because","become","becomes","becoming",
    "been","before","beforehand","behind","being","believe","below","beside","besides","best",
    "better","between","beyond","both","brief","but","by","c","came","can","cannot","cant","cause",
    "causes","certain","certainly","changes","clearly","co","com","come","comes","concerning",
    "consequently","consider","considering","contain","containing","contains","corresponding",
    "could","course","currently","d","definitely","described","despite","did","different","do",
    "does","doing","done","down","downwards","during","e","each","edu","eg","eight","either",
    "else","elsewhere","enough","entirely","especially","et","etc","even","ever","every",
    "everybody","everyone","everything","everywhere","ex","exactly","example","except","f","far",
    "few","fifth","first","five","followed","following","follows","for","former","formerly",
    "forth","four","from","further","furthermore","g","get","gets","getting","given","gives","go",
    "goes","going","gone","got","gotten","greetings","h","had","happens","hardly","has","have",
    "having","he","hello","help","hence","her","here","hereafter","hereby","herein","hereupon",
    "hers","herself","hi","him","himself","his","hither","hopefully","how","howbeit","however","i",
    "ie","if","ignored","immediate","in","inasmuch","inc","indeed","indicate","indicated",
    "indicates","inner","insofar","instead","into","inward","is","it","its","itself","j","just",
    "k","keep","keeps","kept","know","knows","known","l","last","lately","later","latter",
    "latterly","least","less","lest","let","like","liked","likely","little","ll","you'll","look",
    "looking","looks","ltd","m","mainly","many","may","maybe","me","mean","meanwhile","merely",
    "might","more","moreover","most","mostly","much","must","my","myself","n","name","namely","nd",
    "near","nearly","necessary","need","needs","neither","never","nevertheless","new","next",
    "nine","no","nobody","non","none","noone","nor","normally","not","nothing","novel","now",
    "nowhere","o","obviously","of","off","often","oh","ok","okay","old","on","once","one","ones",
    "only","onto","or","other","others","otherwise","ought","our","ours","ourselves","out",
    "outside","over","overall","own","p","particular","particularly","per","perhaps","placed",
    "please","plus","possible","presumably","probably","provides","q","que","quite","qv","r",
    "rather","rd","re","really","reasonably","regarding","regardless","regards","relatively",
    "respectively","right","s","said","same","saw","say","saying","says","second","secondly","see",
    "seeing","seem","seemed","seeming","seems","seen","self","selves","sensible","sent","serious",
    "seriously","seven","several","shall","she","should","since","six","so","some","somebody",
    "somehow","someone","something","sometime","sometimes","somewhat","somewhere","soon","sorry",
    "specified","specify","specifying","still","sub","such","sup","sure","t","take","taken","tell",
    "tends","th","than","thank","thanks","thanx","that","thats","the","their","theirs","them",
    "themselves","then","thence","there","thereafter","thereby","therefore","therein","theres",
    "thereupon","these","they","think","third","this","thorough","thoroughly","those","though",
    "three","through","throughout","thru","thus","to","together","too","took","toward","towards",
    "tried","tries","truly","try","trying","twice","two","u","un","under","unfortunately","unless",
    "unlikely","until","unto","up","upon","us","use","used","useful","uses","using","usually",
    "uucp","v","value","various","you've","ve","very","via","viz","vs","w","want","wants","was",
    "way","we","welcome","well","went","were","what","whatever","when","whence","whenever","where",
    "whereafter","whereas","whereby","wherein","whereupon","wherever","whether","which","while",
    "whither","who","whoever","whole","whom","whose","why","will","willing","wish","with","within",
    "without","wonder","would","would","x","y","yes","yet","you","your","yours","yourself",
    "yourselves","z","zero",
    "á","áäéáêïðá","áé","áêïìá","áêïìç","áêñéâùò","áëçèåéá","áëçèéíá","áëëá","áëëá÷ïõ","áëëåò",
    "áëëç","áëëçí","áëëçò","áëëéùò","áëëéùôéêá","áëëï","áëëïé","áëëïéùò","áëëïéùôéêá","áëëïí",
    "áëëïò","áëëïôå","áëëïõ","áëëïõò","áëëùí","áìá","áìåóá","áìåóùò","áí","áíá","áíáìåóá",
    "áíáìåôáîõ","áíåõ","áíôé","áíôéðåñá","áíôéò","áíù","áíùôåñù","áîáöíá","áð","áðåíáíôé","áðï",
    "áðïøå","áñá","áñáãå","áñãá","áñãïôåñá","áñãïôåñï","áñéóôåñá","áñêåôá","áñ÷éêá","áò","áõñéï",
    "áõôá","áõôåò","áõôç","áõôçí","áõôçò","áõôï","áõôïé","áõôïí","áõôïò","áõôïõ","áõôïõò","áõôùí",
    "áöïôïõ","áöïõ","â","âåâáéá","âåâáéïôáôá","ã","ãé","ãéá","ãñçãïñá","ãõñù","ä","äá","äå",
    "äåéíá","äåí","äåîéá","äçèåí","äçëáäç","äé","äéá","äéáñêùò","äéêá","äéêï","äéêïé","äéêïò",
    "äéêïõ","äéêïõò","äéïëïõ","äéðëá","äé÷ùò","å","åáí","åáõôï","åáõôïí","åáõôïõ","åáõôïõò",
    "åáõôùí","åãêáéñá","åãêáéñùò","åãù","åäù","åé","åéäåìç","åéèå","åéìáé","åéìáóôå","åéíáé","åéò",
    "åéóáé","åéóáóôå","åéóôå","åéôå","åé÷á","åé÷áìå","åé÷áí","åé÷áôå","åé÷å","åé÷åò","åêáóôá",
    "åêáóôåò","åêáóôç","åêáóôçí","åêáóôçò","åêáóôï","åêáóôïé","åêáóôïí","åêáóôïò","åêáóôïõ",
    "åêáóôïõò","åêáóôùí","åêåé","åêåéíá","åêåéíåò","åêåéíç","åêåéíçí","åêåéíçò","åêåéíï","åêåéíïé",
    "åêåéíïí","åêåéíïò","åêåéíïõ","åêåéíïõò","åêåéíùí","åêôïò","åìáò","åìåéò","åìåíá","åìðñïò",
    "åí","åíá","åíáí","åíáò","åíïò","åíôåëùò","åíôïò","åíôùìåôáîõ","åíù","åî","åîáöíá","åîçò",
    "åîéóïõ","åîù","åðáíù","åðåéäç","åðåéôá","åðé","åðéóçò","åðïìåíùò","åóáò","åóåéò","åóåíá",
    "åóôù","åóõ","åôåñá","åôåñáé","åôåñáò","åôåñåò","åôåñç","åôåñçò","åôåñï","åôåñïé","åôåñïí",
    "åôåñïò","åôåñïõ","åôåñïõò","åôåñùí","åôïõôá","åôïõôåò","åôïõôç","åôïõôçí","åôïõôçò","åôïõôï",
    "åôïõôïé","åôïõôïí","åôïõôïò","åôïõôïõ","åôïõôïõò","åôïõôùí","åôóé","åõãå","åõèõò","åõôõ÷ùò",
    "åöåîçò","å÷åé","å÷åéò","å÷åôå","å÷èåò","å÷ïìå","å÷ïõìå","å÷ïõí","å÷ôåò","å÷ù","åùò","æ","ç",
    "çäç","çìáóôáí","çìáóôå","çìïõí","çóáóôáí","çóáóôå","çóïõí","çôáí","çôáíå","çôïé","çôôïí",
    "è","èá","é","éäéá","éäéáí","éäéáò","éäéåò","éäéï","éäéïé","éäéïí","éäéïò","éäéïõ","éäéïõò",
    "éäéùí","éäéùò","éé","ééé","éóáìå","éóéá","éóùò","ê","êáèå","êáèåìéá","êáèåìéáò","êáèåíá",
    "êáèåíáò","êáèåíïò","êáèåôé","êáèïëïõ","êáèùò","êáé","êáêá","êáêùò","êáëá","êáëùò","êáìéá",
    "êáìéáí","êáìéáò","êáìðïóá","êáìðïóåò","êáìðïóç","êáìðïóçí","êáìðïóçò","êáìðïóï","êáìðïóïé",
    "êáìðïóïí","êáìðïóïò","êáìðïóïõ","êáìðïóïõò","êáìðïóùí","êáíåéò","êáíåí","êáíåíá","êáíåíáí",
    "êáíåíáò","êáíåíïò","êáðïéá","êáðïéáí","êáðïéáò","êáðïéåò","êáðïéï","êáðïéïé","êáðïéïí",
    "êáðïéïò","êáðïéïõ","êáðïéïõò","êáðïéùí","êáðïôå","êáðïõ","êáðùò","êáô","êáôá","êáôé","êáôéôé",
    "êáôïðéí","êáôù","êéïëáò","êëð","êïíôá","êôë","êõñéùò","ë","ëéãáêé","ëéãï","ëéãùôåñï","ëïãù",
    "ëïéðá","ëïéðïí","ì","ìá","ìáæé","ìáêáñé","ìáêñõá","ìáëéóôá","ìáëëïí","ìáò","ìå","ìåèáõñéï",
    "ìåéïí","ìåëåé","ìåëëåôáé","ìåìéáò","ìåí","ìåñéêá","ìåñéêåò","ìåñéêïé","ìåñéêïõò","ìåñéêùí",
    "ìåóá","ìåô","ìåôá","ìåôáîõ","ìå÷ñé","ìç","ìçäå","ìçí","ìçðùò","ìçôå","ìéá","ìéáí","ìéáò",
    "ìïëéò","ìïëïíïôé","ìïíá÷á","ìïíåò","ìïíç","ìïíçí","ìïíçò","ìïíï","ìïíïé","ìïíïìéáò","ìïíïò",
    "ìïíïõ","ìïíïõò","ìïíùí","ìïõ","ìðïñåé","ìðïñïõí","ìðñáâï","ìðñïò","í","íá","íáé","íùñéò","î",
    "îáíá","îáöíéêá","ï","ïé","ïëá","ïëåò","ïëç","ïëçí","ïëçò","ïëï","ïëïãõñá","ïëïé","ïëïí",
    "ïëïíåí","ïëïò","ïëïôåëá","ïëïõ","ïëïõò","ïëùí","ïëùò","ïëùóäéïëïõ","ïìùò","ïðïéá",
    "ïðïéáäçðïôå","ïðïéáí","ïðïéáíäçðïôå","ïðïéáò","ïðïéáóäçðïôå","ïðïéäçðïôå","ïðïéåò",
    "ïðïéåóäçðïôå","ïðïéï","ïðïéïäçðïôå","ïðïéïé","ïðïéïí","ïðïéïíäçðïôå","ïðïéïò","ïðïéïóäçðïôå",
    "ïðïéïõ","ïðïéïõäçðïôå","ïðïéïõò","ïðïéïõóäçðïôå","ïðïéùí","ïðïéùíäçðïôå","ïðïôå",
    "ïðïôåäçðïôå","ïðïõ","ïðïõäçðïôå","ïðùò","ïñéóìåíá","ïñéóìåíåò","ïñéóìåíùí","ïñéóìåíùò","ïóá",
    "ïóáäçðïôå","ïóåò","ïóåóäçðïôå","ïóç","ïóçäçðïôå","ïóçí","ïóçíäçðïôå","ïóçò","ïóçóäçðïôå",
    "ïóï","ïóïäçðïôå","ïóïé","ïóïéäçðïôå","ïóïí","ïóïíäçðïôå","ïóïò","ïóïóäçðïôå","ïóïõ",
    "ïóïõäçðïôå","ïóïõò","ïóïõóäçðïôå","ïóùí","ïóùíäçðïôå","ïôáí","ïôé","ïôéäçðïôå","ïôïõ","ïõ",
    "ïõäå","ïõôå","ï÷é","ð","ðáëé","ðáíôïôå","ðáíôïõ","ðáíôùò","ðáñá","ðåñá","ðåñé","ðåñéðïõ",
    "ðåñéóóïôåñï","ðåñóé","ðåñõóé","ðéá","ðéèáíïí","ðéï","ðéóù","ðëáé","ðëåïí","ðëçí","ðïéá",
    "ðïéáí","ðïéáò","ðïéåò","ðïéï","ðïéïé","ðïéïí","ðïéïò","ðïéïõ","ðïéïõò","ðïéùí","ðïëõ","ðïóåò",
    "ðïóç","ðïóçí","ðïóçò","ðïóïé","ðïóïò","ðïóïõò","ðïôå","ðïõ","ðïõèå","ðïõèåíá","ðñåðåé","ðñéí",
    "ðñï","ðñïêåéìåíïõ","ðñïêåéôáé","ðñïðåñóé","ðñïò","ðñïôïõ","ðñï÷èåò","ðñï÷ôåò","ðñùôõôåñá",
    "ðùò","ñ","ó","óáí","óáò","óå","óåéò","óçìåñá","óéãá","óïõ","óôá","óôç","óôçí","óôçò","óôéò",
    "óôï","óôïí","óôïõ","óôïõò","óôùí","óõã÷ñïíùò","óõí","óõíáìá","óõíåðùò","óõíçèùò","óõ÷íá",
    "óõ÷íáò","óõ÷íåò","óõ÷íç","óõ÷íçí","óõ÷íçò","óõ÷íï","óõ÷íïé","óõ÷íïí","óõ÷íïò","óõ÷íïõ",
    "óõ÷íïõ","óõ÷íïõò","óõ÷íùí","óõ÷íùò","ó÷åäïí","óùóôá","ô","ôá","ôáäå","ôáõôá","ôáõôåò","ôáõôç",
    "ôáõôçí","ôáõôçò","ôáõôï","ôáõôïí","ôáõôïò","ôáõôïõ","ôáõôùí","ôá÷á","ôá÷áôå","ôåëéêá",
    "ôåëéêùò","ôåò","ôåôïéá","ôåôïéáí","ôåôïéáò","ôåôïéåò","ôåôïéï","ôåôïéïé","ôåôïéïí","ôåôïéïò",
    "ôåôïéïõ","ôåôïéïõò","ôåôïéùí","ôç","ôçí","ôçò","ôé","ôéðïôá","ôéðïôå","ôéò","ôï","ôïé","ôïí",
    "ôïò","ôïóá","ôïóåò","ôïóç","ôïóçí","ôïóçò","ôïóï","ôïóïé","ôïóïí","ôïóïò","ôïóïõ","ôïóïõò",
    "ôïóùí","ôïôå","ôïõ","ôïõëá÷éóôï","ôïõëá÷éóôïí","ôïõò","ôïõôá","ôïõôåò","ôïõôç","ôïõôçí",
    "ôïõôçò","ôïõôï","ôïõôïé","ôïõôïéò","ôïõôïí","ôïõôïò","ôïõôïõ","ôïõôïõò","ôïõôùí","ôõ÷ïí",
    "ôùí","ôùñá","õ","õð","õðåñ","õðï","õðïøç","õðïøéí","õóôåñá","ö","öåñ","öåôïò","÷","÷áìçëá",
    "÷èåò","÷ôåò","÷ùñéò","÷ùñéóôá","ø","øçëá","ù","ùñáéá","ùò","ùóáí","ùóïôïõ","ùóðïõ","ùóôå",
    "ùóôïóï","ù÷"};

/* Για να δούμε αν το κείμενο που μας ενδιαφέρει περιέχει stop words και για την αφαίρεση τους
 * θα χρησιμοποιήσουμε ένα for.
 * 
 * wordList : περιέχει τις λέξεις που θέλουμε να δούμε αν περιέχουν stop words
 *  
 *  for (int j=0; j< stopwords.length; j++) {
 *    if (wordList.contains(stopwords[j])) {
 *    wordList.remove(stopwords[j]);
 *  }
 */

}
